OskarPepryk/diy-tracker-STM32F401RE/hal.cpp
// #include <FreeRTOS.h>
// #include <task.h>
// #include <semphr.h>
// #include <queue.h>

#include "hal.h"

#ifndef WITH_NUCLEO
	#include "stm32f10x.h"
	#include "stm32f10x_flash.h"
	#include "stm32f10x_gpio.h"
	#include "stm32f10x_rcc.h"
	#include "stm32f10x_pwr.h"
	#include "stm32f10x_tim.h"
	#include "stm32f10x_adc.h"
	#include "stm32f10x_exti.h"
	#include "stm32f10x_iwdg.h"
#else
	#include "stm32f4xx.h"
	#include "stm32f4xx_flash.h"
	#include "stm32f4xx_gpio.h"
	#include "stm32f4xx_rcc.h"
	#include "stm32f4xx_pwr.h"
	#include "stm32f4xx_tim.h"
	#include "stm32f4xx_adc.h"
	#include "stm32f4xx_exti.h"
	#include "stm32f4xx_iwdg.h"
#endif

#include "misc.h"

#include "uart.h"
#include "uart1.h"
#include "uart2.h"

#include "spi1.h"

#include "adc.h"

#include "systick.h"

#ifdef WITH_BEEPER
#include "beep.h"
#include "fifo.h"
#endif

#if defined(WITH_I2C1) || defined(WITH_I2C2)
  #include "i2c.h"
#endif


// ======================================================================================
// to deal with the HC-06 Bluetooth module:
//   http://wiki.mikrokopter.de/en/HC-06
//   http://mcuoneclipse.com/2013/06/19/using-the-hc-06-bluetooth-module/
// ask version:     AT+VERSION
// set name:        AT+NAMEOGN
// set pin:         AT+PIN1234
// set baud 115200: AT+BAUD8
// ======================================================================================

// RF board pin-out: RFM69HW

// RESET  1     16  NC
// DIO0   2     15  NSS
// DIO1   3     14  MOSI
// DIO2   4     13  MISO
// DIO3   5     12  SCK
// DIO4   6     11  GND
// DIO5   7     10  ANT
// 3.3V   8      9  GND


// RF board pin-out: RFM95

//   GND  1     16  DIO2
//  MISO  2     15  DIO1
//  MOSI  3     14  DIO0
//   SCK  4     13  3.3V
//   NSS  5     12  DIO4
// RESET  6     11  DIO3
//  DIO5  7     10  ANT
//   GND  8      9  GND


// ======================================================================================

// Blue Pill pin-out: STM32F103C8T6, 64kB of Flash, CPU chip facing up

//                  Vbat     3.3V           -> LED, I2C pull-up
// LED <-           PC13     GND            <- Li-Ion battery
//           XTAL - PC14     5.0V           <- Li-Ion battery
//           XTAL - PC15     PB 9 TIM4.CH4  -> Buzzer
// ENA <- TIM2.CH1  PA 0     PB 8 TIM4.CH3  -> Buzzer
// PPS -> TIM2.CH2  PA 1     PB 7 I2C1.SDA <-> Baro/Gyro/...
// GPS <- USART2.Tx PA 2     PB 6 I2C1.SCL <-> Baro/Gyro/...
// GPS -> USART2.Rx PA 3     PB 5           -> RF.RESET
// RF  <- SPI1.SS   PA 4     PB 4           <- RF.DIO0
// RF  <- SPI1.SCK  PA 5     PB 3           <- RF.DIO4
// RF  -> SPI1.MISO PA 6     PA15
// RF  <- SPI1.MOSI PA 7     PA12 TIM1.ETR <-> USB
// POT -> TIM3.CH3  PB 0     PA11 TIM1.CH4 <-> USB
// BAT -> TIM3.CH4  PB 1     PA10 USART1.Rx <- Console/BT
// BT  <- USART3.Tx PB10     PA 9 USART1.Tx -> Console/BT
// BT  -> USART3.Rx PB11     PA 8 TIM1.CH1
//                 RESET     PB15 SPI2.MOSI -> SD card
// RF  <-           3.3V     PB14 SPI2.MISO <- SD card
// RF  <-            GND     PB13 SPI2.SCK  -> SD card
//                   GND     PB12 SPI2.SS   -> SD card

// ---------------------------------------------------------------------------------------

// Maple Mini pin-out: STM32F103..., 128kB of Flash, CPU chip facing up

//                     VCC            VCC
//                     GND            GND
//                     Vbat           Vbat
//             LED <-  PC13 14    15  PB 7 I2C1.SDA <-> Gyro/Baro
//             XTAL    PC14 13    16  PB 6 I2C1.SCL <-> Gyro/Baro
//             XTAL    PC15 12    17  PB 5           -> RF.RESET
//                    RESET       18  PB 4           <- RF.DIO0
//    ENA <- TIM2.CH1  PA 0 11    19  PB 3           <- RF.DIO4
//    PPS -> TIM2.CH2  PA 1 10    20  PA15
//    GPS <- USART2.Rx PA 2  9    21  PA14 SWCLK
//    GPS -> USART2.Tx PA 3  8    22  PA13 SWDIO
//    RF  <- SPI1.SS   PA 4  7    23  PA12 TIM1.ETR <-> USB
//    RF  <- SPI1.SCK  PA 5  6    24  PA11 TIM1.CH4 <-> USB
//    RF  -> SPI1.MISO PA 6  5    25  PA10 USART1.Rx <- Console/BT
//    RF  <- SPI1.MOSI PA 7  4    26  PA 9 USART1.Tx -> Console/BT
//    POT -> TIM3.CH3  PB 0  3    27  PA 8 TIM1.CH1
//           Boot1     PB 2  2    28  PB15 SPI2.MOSI -> SD card
//    BT  <- USART3.Tx PB10  1    29  PB14 SPI2.MISO <- SD card
//    BT  -> USART3.Tx PB11  0    30  PB13 SPI2.SCK  -> SD card
//                     Vin        31  PB12 SPI2.SS   -> DC card

// PB 8 = push button => Boot0
// PB 1 = PCB LED
// where to put the buzzer ? PB8/9 are not available

// Good document: https://www.mikrocontroller.net/attachment/275556/test.pdf

// ---------------------------------------------------------------------------------------

// OGN-CUBE-1 board by Miroslav: different GPIO, swapped Console and GSP UART, I2C2 for baro

// CPU: STM32F103CBT6 (same as Maple Mini)

// LED    <-  PA 1

// Console <- PA 2 USART2.Tx
// COnsole -> PA 3 USART2.Rx

// GPS    <-  PA 9 USART1.Tx
// GPS    ->  PA10 USART1.Rx

// Baro <->   PB10 I2C2.SCL
// Baro <->   PB11 I2C2.SDA

// RF.SS    <- PB 0
// RF.RESET <- PB 1
// RF.DIO0  -> PB 2
// RF.SCK   <- PA 5 SPI1.SCK
// RF.MISO  -> PA 6 SPI1.MISO
// RF.MOSI  <- PA 7 SPI1.MOSI

// ======================================================================================

uint32_t getUniqueAddress(void)
{ uint32_t ID = UniqueID[0] ^ UniqueID[1] ^ UniqueID[2]; return ID&0x00FFFFFF; }

FlashParameters Parameters; // parameters to be stored in Flash, on the last page

// ======================================================================================

#ifdef WITH_MAVLINK
uint8_t  MAV_Seq = 0;       // sequence number for MAVlink message sent out
#endif

// ======================================================================================

void RCC_Configuration(void)
{
  RCC_DeInit ();                                         // RCC system reset(for debug purpose)

  //STM32F401RE Nucleo doesn't have HSE - Use HSI by default
  //Don't use ST-Link MCO, it won't be available under battery power

#ifndef WITH_NUCLEO
  uint32_t Timeout=80000;
  RCC_HSEConfig (RCC_HSE_ON);                            // Enable HSE (High Speed External clock = Xtal)
  while (RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET)    // Wait till HSE is not ready
  { Timeout--; if(Timeout==0) break; }                   // but it may never come up... as some boards have no Xtal !
  if(Timeout==0) RCC_HSEConfig (RCC_HSE_OFF);            // if Timeout went down to zero: Xtal did not come up
/*
  RCC_HSEConfig (RCC_HSE_OFF);
  while (RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET);   // Wait till HSI is not ready
  Timeout=0;
*/
  RCC_HCLKConfig   (RCC_SYSCLK_Div1);                    // HCLK   = SYSCLK  (for AHB bus)
  RCC_PCLK2Config  (RCC_HCLK_Div1);                      // PCLK2  = HCLK    (for APB2 periph.  max. 72MHz)
  RCC_PCLK1Config  (RCC_HCLK_Div2);                      // PCLK1  = HCLK/2  (for APB1 periph.  max. 36MHz)
  RCC_ADCCLKConfig (RCC_PCLK2_Div4);                     // ADCCLK = PCLK2/4 (for ADC:          max. 12MHz)

