OskarPepryk/diy-tracker-STM32F401RE/hal.cpp
  // *(vu32 *)0x40022000 = 0x01;                            // Flash 2 wait state
  FLASH_SetLatency(FLASH_Latency_2);                     // Flash 2 wait state
  FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);  // Enable Prefetch Buffer

  if(Timeout)                                            // if HSE came up: use it
    RCC_PLLConfig (RCC_PLLSource_HSE_Div2, RCC_PLLMul_15); // PLLCLK = 4MHz * 15 = 60 MHz
  else                                                   // if HSE did not come up: use internal oscilator
    RCC_PLLConfig (RCC_PLLSource_HSI_Div2, RCC_PLLMul_15); // PLLCLK = 4MHz * 15 = 60 MHz

  RCC_PLLCmd (ENABLE);                                   // Enable PLL
  while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);   // Wait till PLL is ready
  RCC_SYSCLKConfig (RCC_SYSCLKSource_PLLCLK);            // Select PLL as system clock source
  while (RCC_GetSYSCLKSource() != 0x08);                 // Wait till PLL is used as system clock source
#else //WITH_NUCLEO
  RCC_HCLKConfig   (RCC_SYSCLK_Div1);                    // HCLK   = SYSCLK  (for AHB bus)
  RCC_PCLK2Config  (RCC_HCLK_Div2);                      // PCLK2  = HCLK    (for APB2 periph.  max. 72MHz)
  RCC_PCLK1Config  (RCC_HCLK_Div2);                      // PCLK1  = HCLK/2  (for APB1 periph.  max. 36MHz)
  FLASH_SetLatency(FLASH_Latency_2);                     // Flash 2 wait state
  FLASH_PrefetchBufferCmd(ENABLE);  // Enable Prefetch Buffer

  RCC_PLLConfig(RCC_PLLSource_HSI, 10, 150, 4, 7); // PLLCLK = 4MHz * 15 = 60 MHz

  RCC_PLLCmd (ENABLE);                                   // Enable PLL
  while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET);   // Wait till PLL is ready
  RCC_SYSCLKConfig (RCC_SYSCLKSource_PLLCLK);            // Select PLL as system clock source
  while (RCC_GetSYSCLKSource() != 0x08);                 // Wait till PLL is used as system clock source
#endif
}

// -------------------------------------------------------------------------------------------------------

#ifdef WITH_BLUE_PILL
void LED_PCB_On   (void) { GPIO_ResetBits(GPIOC, GPIO_Pin_13); }  // LED is on PC.13 and LOW-active
void LED_PCB_Off  (void) { GPIO_SetBits  (GPIOC, GPIO_Pin_13); }
#endif

#ifdef WITH_MAPLE_MINI
void LED_PCB_On  (void) { GPIO_SetBits  (GPIOB, GPIO_Pin_1); }    // LED is on PB.1 and HIGH-active
void LED_PCB_Off (void) { GPIO_ResetBits(GPIOB, GPIO_Pin_1); }
#endif

#ifdef WITH_OGN_CUBE_1
void LED_PCB_On   (void) { GPIO_ResetBits(GPIOA, GPIO_Pin_1); }   // LED is on PA1 and LOW-active
void LED_PCB_Off  (void) { GPIO_SetBits  (GPIOA, GPIO_Pin_1); }
#endif

#ifdef WITH_LED_RX
void LED_RX_On    (void) { GPIO_ResetBits(GPIOD, GPIO_Pin_3); }
void LED_RX_Off   (void) { GPIO_SetBits  (GPIOD, GPIO_Pin_3); }
#endif

#ifdef WITH_LED_TX
void LED_TX_On    (void) { GPIO_ResetBits(GPIOD, GPIO_Pin_4); }
void LED_TX_Off   (void) { GPIO_SetBits  (GPIOD, GPIO_Pin_4); }
#endif

#ifdef WITH_NUCLEO //STM32F4 On-board LED pin is taken by SPI, so we cannot use it
void LED_PCB_On   (void) { GPIO_SetBits(GPIOC, GPIO_Pin_2); }  // Blue LED is on PC2 and HIGH-active
void LED_PCB_Off  (void) { GPIO_ResetBits  (GPIOC, GPIO_Pin_2); }
void LED_RX_On    (void) { GPIO_SetBits(GPIOC, GPIO_Pin_0); }
void LED_RX_Off   (void) { GPIO_ResetBits  (GPIOC, GPIO_Pin_0); }
void LED_TX_On    (void) { GPIO_SetBits(GPIOC, GPIO_Pin_1); }
void LED_TX_Off   (void) { GPIO_ResetBits  (GPIOC, GPIO_Pin_1); }
#endif


static void LED_GPIO_Configuration (void)             // LED on the PCB
{ GPIO_InitTypeDef  GPIO_InitStructure;

#ifdef WITH_BLUE_PILL
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_13;        // Configure PC.13 as output (blue LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

#ifdef WITH_MAPLE_MINI
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;         // Configure PB.1 as output (blue LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
#endif

#ifdef WITH_OGN_CUBE_1
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;         // Configure PA.1 as output (blue LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

#ifdef WITH_NUCLEO
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;         // Configure PC0 as output (green LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;         // Configure PC1 as output (red LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2;         // Configure PC2 as output (blue LED on the PCB)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

  LED_PCB_Off(); }

// -------------------------------------------------------------------------------------------------------

// function to control and read status of the RF chip

#if defined(WITH_BLUE_PILL) || defined(WITH_MAPLE_MINI) || defined(WITH_NUCLEO) // classical DIY-Tracker

// PB5: RF chip RESET: active HIGH for RFM69, active low for RFM95
#ifdef SPEEDUP_STM_LIB
#ifndef WITH_NUCLEO
inline void RFM_RESET_High  (void) { GPIOB->BSRR = GPIO_Pin_5; }
inline void RFM_RESET_Low   (void) { GPIOB->BRR  = GPIO_Pin_5; }
#else
inline void RFM_RESET_High  (void) { GPIOB->BSRRL = GPIO_Pin_5; }
inline void RFM_RESET_Low   (void) { GPIOB->BSRRH  = GPIO_Pin_5; }
#endif // WITH_NUCLEO
#else
inline void RFM_RESET_High  (void) { GPIO_SetBits  (GPIOB, GPIO_Pin_5); }
inline void RFM_RESET_Low   (void) { GPIO_ResetBits(GPIOB, GPIO_Pin_5); }
#endif // SPEEDUP_STM_LIB

void RFM_Select  (void) { SPI1_Select(); }
void RFM_Deselect(void) { SPI1_Deselect(); }

// PB4: RF chip IRQ: active HIGH
#ifdef SPEEDUP_STM_LIB
bool RFM_IRQ_isOn(void)   { return (GPIOB->IDR & GPIO_Pin_4) != 0; }
// bool RFM_DIO4_isOn(void)   { return (GPIOB->IDR & GPIO_Pin_3) != 0; }
#else
bool RFM_IRQ_isOn(void)   { return GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4) != Bit_RESET; }
// bool RFM_DIO4_isOn(void)   { return GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_3) != Bit_RESET; }
#endif

#endif // BLUE_PILL or MAPLE_MINI

#ifdef WITH_OGN_CUBE_1 // OGN-CUBE-1

