OskarPepryk/diy-tracker-STM32F401RE/hal.cpp
// PB1: RF chip RESET: active HIGH for RFM69, active low for RFM95
#ifdef SPEEDUP_STM_LIB
inline void RFM_RESET_High  (void) { GPIOB->BSRR = GPIO_Pin_1; }
inline void RFM_RESET_Low   (void) { GPIOB->BRR  = GPIO_Pin_1; }
#else
inline void RFM_RESET_High  (void) { GPIO_SetBits  (GPIOB, GPIO_Pin_1); }
inline void RFM_RESET_Low   (void) { GPIO_ResetBits(GPIOB, GPIO_Pin_1); }
#endif

// PB0: RF chip SELECT: active LOW
#ifdef SPEEDUP_STM_LIB
void RFM_Select  (void) { GPIOB->BRR  = GPIO_Pin_0; }
void RFM_Deselect(void) { GPIOB->BSRR = GPIO_Pin_0; }
#else
void RFM_Select  (void) { GPIO_WriteBit(GPIOB, GPIO_Pin_0, Bit_RESET); }
void RFM_Deselect(void) { GPIO_WriteBit(GPIOB, GPIO_Pin_0, Bit_SET  ); }
#endif

// PB2: RF chip IRQ: active HIGH
#ifdef SPEEDUP_STM_LIB
bool RFM_IRQ_isOn(void)   { return (GPIOB->IDR & GPIO_Pin_2) != 0; }
#else
bool RFM_IRQ_isOn(void)   { return GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_2) != Bit_RESET; }
#endif

#endif // OGN_CUBE

#ifdef WITH_RFM95                     // RESET is active LOW
void RFM_RESET(uint8_t On)
{ if(On) RFM_RESET_Low();
    else RFM_RESET_High(); }
#endif

#if defined(WITH_RFM69) || defined(WITH_SX1272) // RESET is active HIGH
void RFM_RESET(uint8_t On)
{ if(On) RFM_RESET_High();
    else RFM_RESET_Low(); }
#endif

// RF chip interface for OGN-CUBE-1:
// RF.SS    <- PB 0
// RF.RESET <- PB 1
// RF.DIO0  -> PB 2
// RF.SCK   <- PA 5 SPI1.SCK
// RF.MISO  -> PA 6 SPI1.MISO
// RF.MOSI  <- PA 7 SPI1.MOSI

static void RFM_GPIO_Configuration(void)
{ GPIO_InitTypeDef  GPIO_InitStructure;

#if defined(WITH_BLUE_PILL) || defined(WITH_MAPLE_MINI)
  GPIO_InitStructure.GPIO_Pin   = /* GPIO_Pin_3 | */ GPIO_Pin_4;      // PB4 = DIO0 and PB3 = DIO4 of RFM69
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
  // GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;                         // PB5 = RESET
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

#ifdef WITH_RF_IRQ
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;                  // Enable the external I/O Interrupt
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;         // 0 = highest, 15 = lowest priority
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource4);
  EXTI_InitTypeDef EXTI_InitStructure;
  EXTI_InitStructure.EXTI_Line = EXTI_Line4;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  NVIC_EnableIRQ(EXTI4_IRQn);
#endif // WITH_RF_IRQ

#endif // WITH_BLUE_PILL || WITH_MAPLE_MINI

#ifdef WITH_NUCLEO
  GPIO_InitStructure.GPIO_Pin   = /* GPIO_Pin_3 | */ GPIO_Pin_4;      // PB4 = DIO0 and PB3 = DIO4 of RFM69
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  // GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;                         // PB5 = RESET
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

#ifdef WITH_RF_IRQ
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;                  // Enable the external I/O Interrupt
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;         // 0 = highest, 15 = lowest priority
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource4);
  EXTI_InitTypeDef EXTI_InitStructure;
  EXTI_InitStructure.EXTI_Line = EXTI_Line4;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  NVIC_EnableIRQ(EXTI4_IRQn);
#endif // WITH_RF_IRQ
#endif // WITH_NUCLEO

#ifdef WITH_OGN_CUBE_1
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2;                        // PB2 = DIO0 RFM69/95
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
  // GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0 | GPIO_Pin_1;            // PB1 = RESET, PB0 = SS
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

#ifdef WITH_RF_IRQ
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;                  // Enable the external I/O Interrupt
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;         // 0 = highest, 15 = lowest priority
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource2);
  EXTI_InitTypeDef EXTI_InitStructure;
  EXTI_InitStructure.EXTI_Line = EXTI_Line2;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  NVIC_EnableIRQ(EXTI2_IRQn);
#endif // WITH_RF_IRQ

#endif // WITH_OGN_CUBE_1

RFM_RESET(0);
RFM_Deselect();

}

#ifdef WITH_RF_IRQ
void (*RF_IRQ_Callback)(void) = 0;
#endif

#ifdef WITH_RF_IRQ
#ifdef __cplusplus
  extern "C"
#endif
#if defined(WITH_BLUE_PILL) || defined(WITH_MAPLE_MINI)          
void EXTI4_IRQHandler(void)                                      // RF chip DIO0 interrupt
{
  if(EXTI_GetITStatus(EXTI_Line4) != RESET)
  { if(RF_IRQ_Callback) (*RF_IRQ_Callback)(); }                  // execute the callback
  EXTI_ClearITPendingBit(EXTI_Line4);
}
#endif
#ifdef WITH_OGN_CUBE_1
void EXTI2_IRQHandler(void)                                      // RF chip DIO0 interrupt
{
  if(EXTI_GetITStatus(EXTI_Line2) != RESET)
  { if(RF_IRQ_Callback) (*RF_IRQ_Callback)(); }                  // execute the callback
  EXTI_ClearITPendingBit(EXTI_Line2);
}
#endif
#endif

