OskarPepryk/diy-tracker-STM32F401RE/hal.cpp
uint8_t RFM_TransferByte(uint8_t Byte) { return SPI1_TransferByte(Byte); }

// -------------------------------------------------------------------------------------------------------

#ifndef WITH_NUCLEO
SemaphoreHandle_t I2C_Mutex[2];

static I2C_TypeDef *I2C_Bus[2] = { I2C1, I2C2 } ;

uint8_t I2C_Read(uint8_t Bus, uint8_t Addr, uint8_t Reg, uint8_t *Data, uint8_t Len, uint8_t Wait)
{ xSemaphoreTake(I2C_Mutex[Bus], portMAX_DELAY);
  uint8_t Err=I2C_Read(I2C_Bus[Bus], Addr, Reg, Data, Len);
  xSemaphoreGive(I2C_Mutex[Bus]);
  return Err; }

uint8_t I2C_Write(uint8_t Bus, uint8_t Addr, uint8_t Reg, uint8_t *Data, uint8_t Len, uint8_t Wait)
{ xSemaphoreTake(I2C_Mutex[Bus], portMAX_DELAY);
  uint8_t Err=I2C_Write(I2C_Bus[Bus], Addr, Reg, Data, Len);
  xSemaphoreGive(I2C_Mutex[Bus]);
  return Err; }

uint8_t I2C_Restart(uint8_t Bus)
{ xSemaphoreTake(I2C_Mutex[Bus], portMAX_DELAY);
  I2C_Restart(I2C_Bus[Bus], I2C_SPEED);
  xSemaphoreGive(I2C_Mutex[Bus]);
  return 0; }
#else
	//TODO STM32F4
#endif

// -------------------------------------------------------------------------------------------------------

SemaphoreHandle_t ADC1_Mutex; // ADC1 Mutex for Knob, temperature/voltage readout, etc.

uint16_t ADC_Read_MCU_Vtemp(void) { return ADC1_Read(ADC_Channel_TempSensor); }
uint16_t ADC_Read_MCU_Vref (void) { return ADC1_Read(ADC_Channel_Vrefint); }
uint16_t ADC_Read_Knob     (void) { return ADC1_Read(ADC_Channel_8); }
uint16_t ADC_Read_Vbatt    (void) { return ADC1_Read(ADC_Channel_9); }

uint16_t MCU_Vref=0;                // [0.25ADC] measured internal voltage reference = 1.25V
uint16_t MCU_Vtemp=0;               // [0.25ADC]
 int16_t MCU_Temp=0;                // [0.1degC] measured internal temperature sensor
uint16_t MCU_Vbatt=0;               // [0.001V] measured battery voltage

uint16_t Measure_MCU_Vref(void)
{ xSemaphoreTake(ADC1_Mutex, portMAX_DELAY);
  ADC_Read_MCU_Vref();
  if(MCU_Vref==0) MCU_Vref = ADC_Read_MCU_Vref()*4;
  uint16_t Vref=ADC_Read_MCU_Vref();
  xSemaphoreGive(ADC1_Mutex);
  MCU_Vref = (3*MCU_Vref+2)/4 + Vref;
  return MCU_Vref; }               // [0.25ADC]

 int16_t Measure_MCU_Temp(void)
{ Measure_MCU_Vref();
  xSemaphoreTake(ADC1_Mutex, portMAX_DELAY);
  ADC_Read_MCU_Vtemp();
  if(MCU_Vtemp==0) MCU_Vtemp = ADC_Read_MCU_Vtemp()*4;
  uint16_t Vtemp = ADC_Read_MCU_Vtemp();
  xSemaphoreGive(ADC1_Mutex);
  MCU_Vtemp = (3*MCU_Vtemp+2)/4 + Vtemp;
  // MCU_Vtemp = ((int32_t)1250*MCU_Vtemp+(MCU_Vref>>1))/MCU_Vref;          // [mV]
  // MCU_Temp  = 250 + ((((int32_t)1430-MCU_Vtemp)*37+8)>>4);               // [0.1degC]
  // MCU_Temp = 250 + ( ( ( (int32_t)1430 - ((int32_t)1250*(int32_t)MCU_Vtemp+(MCU_Vref>>1))/MCU_Vref )*(int32_t)37 +8 )>>4); // [0.1degC]
#ifndef WITH_NUCLEO
MCU_Temp = 250 + ( ( ( (int32_t)14300 - ((int32_t)12500*(int32_t)MCU_Vtemp+(MCU_Vref>>1))/MCU_Vref )*(int32_t)119 + 256 )>>9); // [0.1degC]
#else
//TODO
MCU_Temp = 250 + ( ( ( (int32_t)7600 - ((int32_t)12500*(int32_t)MCU_Vtemp+(MCU_Vref>>1))/MCU_Vref )*(int32_t)119 + 256 )>>11); // [0.1degC]
#endif
  return MCU_Temp; }             // [0.1degC]
                                 // Datasheet, page 80, 1.43V at 25degC, 4.3mV/degC, 17us sampling time

uint16_t Measure_MCU_VCC(void)
{ Measure_MCU_Vref();                                                 // this assumes Vref of the MCU = VCC and internal reference is 2.5V
  return ( ((uint32_t)5000<<12)+(MCU_Vref>>1))/MCU_Vref; }            // [1mV]}

#ifdef WITH_VBATT_SENSE
uint16_t Measure_Vbatt(void)
{ Measure_MCU_Vref();
  xSemaphoreTake(ADC1_Mutex, portMAX_DELAY);
  ADC_Read_Vbatt();
  uint16_t Vtemp = ADC_Read_Vbatt() + ADC_Read_Vbatt();                // [0.5ADC]
  xSemaphoreGive(ADC1_Mutex);
  // MCU_Vbatt = ((int32_t)154*(int32_t)Vbatt+(MCU_Vref>>1))/MCU_Vref; } // [1/64V] battery voltage assuming 1:1 divider from battery to PB1
  MCU_Vbatt = ((int32_t)1250*(int32_t)Vbatt+(MCU_Vref>>1))/MCU_Vref;   // [1mV] battery voltage assuming 1:1 divider from battery to PB1
  return MCU_Vbatt; }
#endif

// -------------------------------------------------------------------------------------------------------

#ifdef WITH_GPS_ENABLE
void GPS_DISABLE(void) { GPIO_ResetBits(GPIOA, GPIO_Pin_0); }
void GPS_ENABLE (void) { GPIO_SetBits  (GPIOA, GPIO_Pin_0); }
#endif

#ifdef WITH_GPS_PPS
#ifndef WITH_NUCLEO
bool GPS_PPS_isOn(void) { return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_1) != Bit_RESET; }
#else
bool GPS_PPS_isOn(void) { return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) != Bit_RESET; }
#endif
#endif

static void GPS_GPIO_Configuration (void)
{ GPIO_InitTypeDef  GPIO_InitStructure;

#ifdef WITH_GPS_ENABLE
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;        // Configure PA.00 as output: GPS Enable(HIGH) / Shutdown(LOW)
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

#ifdef WITH_GPS_PPS
#ifndef WITH_NUCLEO
GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1;         // Configure PA.01 as input: PPS from GPS
GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPD;
GPIO_Init(GPIOA, &GPIO_InitStructure);
#else
GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8;         // Configure PA.8 as input: PPS from GPS
GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN;
GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif // WITH_NUCLEO
#endif // WITH_GPS_PPS

#ifdef WITH_PPS_IRQ
#ifndef WITH_NUCLEO
NVIC_InitTypeDef NVIC_InitStructure;
NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;                  // Enable the external I/O Interrupt
NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;         // 0 = highest, 15 = lowest priority
NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
NVIC_Init(&NVIC_InitStructure);

GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource1);
EXTI_InitTypeDef EXTI_InitStructure;
EXTI_InitStructure.EXTI_Line = EXTI_Line1;
EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
EXTI_InitStructure.EXTI_LineCmd = ENABLE;
EXTI_Init(&EXTI_InitStructure);
NVIC_EnableIRQ(EXTI1_IRQn);
#else
NVIC_InitTypeDef NVIC_InitStructure;
NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;                  // Enable the external I/O Interrupt
NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;         // 0 = highest, 15 = lowest priority
NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
NVIC_Init(&NVIC_InitStructure);

SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource8);
EXTI_InitTypeDef EXTI_InitStructure;
EXTI_InitStructure.EXTI_Line = EXTI_Line8;
EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
EXTI_InitStructure.EXTI_LineCmd = ENABLE;
EXTI_Init(&EXTI_InitStructure);
NVIC_EnableIRQ(EXTI9_5_IRQn);
#endif
#endif

#ifdef WITH_GPS_ENABLE
  GPS_ENABLE();
#endif
}

#ifdef WITH_PPS_IRQ
void (*GPS_PPS_IRQ_Callback)(uint32_t TickCount, uint32_t TickTime) = 0;
#endif

#ifdef WITH_PPS_IRQ
#ifdef __cplusplus
extern "C"
#endif
#ifndef WITH_NUCLEO
void EXTI1_IRQHandler(void)                                        // PPS interrupt
{ uint32_t TickTime = getSysTick_Count();                          // [CPU tick] what time before the next RTOS tick the interrupt arrived
uint32_t Load     = getSysTick_Reload();                         // [CPU tick] period of the SysTick - 1
TickTime          = Load-TickTime;                               // [CPU tick] what time after RTOS tick the PPS arrived
TickType_t TickCount = xTaskGetTickCountFromISR();               // [RTOS tick] RTOS tick counter

if(EXTI_GetITStatus(EXTI_Line1) != RESET)
{ if( GPS_PPS_IRQ_Callback && GPS_PPS_isOn() ) (*GPS_PPS_IRQ_Callback)(TickCount, TickTime); }          // execute the callback
EXTI_ClearITPendingBit(EXTI_Line1);
}
#else
void EXTI9_5_IRQHandler(void)                                        // PPS interrupt
{ uint32_t TickTime = getSysTick_Count();                          // [CPU tick] what time before the next RTOS tick the interrupt arrived
uint32_t Load     = getSysTick_Reload();                         // [CPU tick] period of the SysTick - 1
TickTime          = Load-TickTime;                               // [CPU tick] what time after RTOS tick the PPS arrived
TickType_t TickCount = xTaskGetTickCountFromISR();               // [RTOS tick] RTOS tick counter

if(EXTI_GetITStatus(EXTI_Line8) != RESET)
{
	if( GPS_PPS_IRQ_Callback && GPS_PPS_isOn() )
		(*GPS_PPS_IRQ_Callback)(TickCount, TickTime);
}          // execute the callback
	EXTI_ClearITPendingBit(EXTI_Line8);
}
#endif //WITH_NUCLEO
#endif //WITH_PPS_IRQ

