OskarPepryk/diy-tracker-STM32F401RE/hal.cpp
// -------------------------------------------------------------------------------------------------------

SemaphoreHandle_t CONS_Mutex; // console port Mutex

void UART_Configuration(int CONS_BaudRate, int GPS_BaudRate)
{
  CONS_Mutex = xSemaphoreCreateMutex();
#ifdef WITH_SWAP_UARTS
  UART2_Configuration(CONS_BaudRate);
  UART1_Configuration(GPS_BaudRate);
#else
  UART1_Configuration(CONS_BaudRate);
  UART2_Configuration(GPS_BaudRate);
#endif
}

#ifdef WITH_SWAP_UARTS
int  CONS_UART_Read  (uint8_t &Byte)  { return UART2_Read (Byte); }
void CONS_UART_Write (char     Byte)  {        UART2_Write(Byte); }
int  CONS_UART_Free  (void)           { return UART2_Free(); }
int  CONS_UART_Full  (void)           { return UART2_Full(); }
void CONS_UART_SetBaudrate(int BaudRate) { UART2_SetBaudrate(BaudRate); }
int   GPS_UART_Read  (uint8_t &Byte)  { return UART1_Read (Byte); }
void  GPS_UART_Write (char     Byte)  {        UART1_Write(Byte); }
void  GPS_UART_SetBaudrate(int BaudRate) { UART1_SetBaudrate(BaudRate); }
#else
int  CONS_UART_Read  (uint8_t &Byte)  { return UART1_Read (Byte); }
void CONS_UART_Write (char     Byte)  {        UART1_Write(Byte); }
int  CONS_UART_Free  (void)           { return UART1_Free(); }
int  CONS_UART_Full  (void)           { return UART1_Full(); }
void CONS_UART_SetBaudrate(int BaudRate) { UART1_SetBaudrate(BaudRate); }
int   GPS_UART_Read  (uint8_t &Byte)  { return UART2_Read (Byte); }
void  GPS_UART_Write (char     Byte)  {        UART2_Write(Byte); }
void  GPS_UART_SetBaudrate(int BaudRate) { UART2_SetBaudrate(BaudRate); }
#endif

// -------------------------------------------------------------------------------------------------------


// -------------------------------------------------------------------------------------------------------

void IO_Configuration(void)
{
  RCC_Configuration();

#ifndef WITH_NUCLEO
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
#else
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
#endif
  LED_GPIO_Configuration();                              // LED
  GPS_GPIO_Configuration();                              // GPS PPS, Enable, PPS IRQ

  RFM_GPIO_Configuration();                              // RF Reset, IRQ
  SPI1_Configuration();                                  // RF SPI

  ADC1_Mutex = xSemaphoreCreateMutex();
  ADC_Configuration();                                   // ADC to measure MCU temperature and supply voltage

#ifdef WITH_BEEPER
  Beep_Configuration();
#endif

#ifdef WITH_I2C1
  I2C_Configuration(I2C1, I2C_SPEED);      // 400kHz I2C bus speed
#endif

#ifdef WITH_I2C2
  I2C_Configuration(I2C2, I2C_SPEED);      // 400kHz I2C bus speed
#endif

#if defined(WITH_I2C1) || defined(WITH_I2C2)
  I2C_Mutex[0] = xSemaphoreCreateMutex();
  I2C_Mutex[1] = xSemaphoreCreateMutex();
#endif

  IWDG_Configuration();                    // setup watch-dog
  IWDG_ReloadCounter();
  IWDG_Enable();
}

// -------------------------------------------------------------------------------------------------------

void IWDG_Configuration(void)                       // setup watch-dog
{ IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
  IWDG_SetPrescaler(IWDG_Prescaler_8);              // about 40kHz/8 = 5kHz counter
  IWDG_SetReload(250); }                            // reload with 250 thus 50ms timeout ?

// -------------------------------------------------------------------------------------------------------

#ifdef WITH_BEEPER

uint8_t  Vario_Note=0x00; // 0x40;
uint16_t Vario_Period=800;
uint16_t Vario_Fill=50;

static volatile uint16_t Vario_Time=0;

static volatile uint8_t Play_Note=0;             // Note being played
static volatile uint8_t Play_Counter=0;          // [ms] time counter

static FIFO<uint16_t, 8> Play_FIFO;              // queue of notes to play

void Play(uint8_t Note, uint8_t Len)             // [Note] [ms] put a new not to play in the queue
{ uint16_t Word = Note; Word<<=8; Word|=Len; Play_FIFO.Write(Word); }

uint8_t Play_Busy(void) { return Play_Counter; } // is a note being played right now ?

static void Play_TimerCheck(void)                // every ms serve the note playing
{ uint8_t Counter=Play_Counter;
  if(Counter)                                    // if counter non-zero
  { Counter--;                                   // decrement it
    if(!Counter) Beep_Note(Play_Note=0x00);      // if reached zero, stop playing the note
  }
  if(!Counter)                                   // if counter reached zero
  { if(!Play_FIFO.isEmpty())                     // check for notes in the queue
    { uint16_t Word=0; Play_FIFO.Read(Word);     // get the next note
      Beep_Note(Play_Note=Word>>8); Counter=Word&0xFF; }   // start playing it, load counter with the note duration
  }
  Play_Counter=Counter;

  uint16_t Time=Vario_Time;
  Time++; if(Time>=Vario_Period) Time=0;
  Vario_Time = Time;

  if(Counter==0)                            // when no notes are being played, make the vario sound
  { if(Time<=Vario_Fill)
    { if(Play_Note!=Vario_Note) Beep_Note(Play_Note=Vario_Note); }
    else
    { if(Play_Note!=0) Beep_Note(Play_Note=0x00); }
  }
}

#endif // WITH_BEEPER

// -------------------------------------------------------------------------------------------------------

volatile uint8_t LED_PCB_Counter = 0;
void LED_PCB_Flash(uint8_t Time) { if(Time>LED_PCB_Counter) LED_PCB_Counter=Time; } // [ms]

#ifdef WITH_LED_TX
volatile uint8_t LED_TX_Counter = 0;
void LED_TX_Flash(uint8_t Time) { if(Time>LED_TX_Counter) LED_TX_Counter=Time; } // [ms]
#endif

#ifdef WITH_LED_RX
volatile uint8_t LED_RX_Counter = 0;
void LED_RX_Flash(uint8_t Time) { if(Time>LED_RX_Counter) LED_RX_Counter=Time; } // [ms]
#endif

#ifdef WITH_LED_BAT
volatile uint8_t LED_BAT_Counter = 0;
void LED_BAT_Flash(uint8_t Time) { if(Time>LED_BAT_Counter) LED_BAT_Counter=Time; } // [ms]
#endif

void LED_TimerCheck(uint8_t Ticks)
{ uint8_t Counter=LED_PCB_Counter;
  if(Counter)
  { if(Ticks<Counter) Counter-=Ticks;
                 else Counter =0;
    if(Counter) LED_PCB_On();
           else LED_PCB_Off();
    LED_PCB_Counter=Counter; }
#ifdef WITH_LED_TX
  Counter=LED_TX_Counter;
  if(Counter)
  { if(Ticks<Counter) Counter-=Ticks;
                 else Counter =0;
    if(Counter) LED_TX_On();
           else LED_TX_Off();
    LED_TX_Counter=Counter; }
#endif
#ifdef WITH_LED_RX
  Counter=LED_RX_Counter;
  if(Counter)
  { if(Ticks<Counter) Counter-=Ticks;
                 else Counter =0;
    if(Counter) LED_RX_On();
           else LED_RX_Off();
    LED_RX_Counter=Counter; }
#endif
#ifdef WITH_LED_BAT
  Counter=LED_BAT_Counter;
  if(Counter)
  { if(Ticks<Counter) Counter-=Ticks;
                 else Counter =0;
    if(Counter) LED_BAT_On();
           else LED_BAT_Off();
    LED_BAT_Counter=Counter; }
#endif
}

// -------------------------------------------------------------------------------------------------------

extern "C"
void vApplicationIdleHook(void) // when RTOS is idle: should call "sleep until an interrupt"
{ __WFI();                      // wait-for-interrupt
}

extern "C"
void vApplicationTickHook(void) // RTOS timer tick hook
{ IWDG_ReloadCounter();         // reset watch-dog at every tick (primitive, but enough to start)

  LED_TimerCheck(1);

#ifdef WITH_BEEPER
  Play_TimerCheck();            // Play note periodic check
#endif
}

// -------------------------------------------------------------------------------------------------------

